Repository: Neira21/Learning-Angular
Catalog: i18n-internacionalizacion/src/locale/messages.*.xlf
Languages: de, fr, it

source: Nuevo Smartphone Galaxy Pro
de: Neues Galaxy Pro Smartphone
fr: Nouveau Smartphone Galaxy Pro
it: Nuovo Smartphone Galaxy Pro

source: reseñas
de: Bewertungen
fr: avis
it: recensioni

source: Descripción del Producto
de: Produktbeschreibung
fr: Description du Produit
it: Descrizione del Prodotto

source: Smartphone de última generación con pantalla AMOLED de 6.7 pulgadas, procesador octa-core de alta velocidad, cámara triple de 108MP y batería de larga duración de 5000mAh. Incluye carga rápida de 65W y conectividad 5G.
de: Smartphone der neuesten Generation mit 6,7-Zoll-AMOLED-Display, Hochgeschwindigkeits-Octa-Core-Prozessor, 108MP-Dreifachkamera und langlebiger 5000mAh-Batterie. Inklusive 65W-Schnellladung und 5G-Konnektivität.
fr: Smartphone de dernière génération avec écran AMOLED de 6,7 pouces, processeur octa-core haute vitesse, caméra triple 108MP et batterie longue durée de 5000mAh. Comprend une charge rapide de 65W et la connectivité 5G.
it: Smartphone di ultima generazione con display AMOLED da 6,7 pollici, processore octa-core ad alta velocità, fotocamera tripla da 108MP e batteria di lunga durata da 5000mAh. Include ricarica rapida da 65W e connettività 5G.

source: Características principales
de: Hauptmerkmale
fr: Caractéristiques principales
it: Caratteristiche principali

source: Pantalla: 6.7" AMOLED 120Hz
de: Display: 6,7" AMOLED 120Hz
fr: Écran: 6,7" AMOLED 120Hz
it: Display: 6,7" AMOLED 120Hz

source: Memoria: 256GB almacenamiento, 12GB RAM
de: Speicher: 256GB Speicherplatz, 12GB RAM
fr: Mémoire: 256GB stockage, 12GB RAM
it: Memoria: 256GB archiviazione, 12GB RAM

source: Cámara: Triple 108MP + 12MP + 5MP
de: Kamera: Dreifach 108MP + 12MP + 5MP
fr: Caméra: Triple 108MP + 12MP + 5MP
it: Fotocamera: Tripla 108MP + 12MP + 5MP

source: Batería: 5000mAh con carga rápida 65W
de: Batterie: 5000mAh mit 65W Schnellladung
fr: Batterie: 5000mAh avec charge rapide 65W
it: Batteria: 5000mAh con ricarica rapida 65W

source: Conectividad: 5G, WiFi 6, Bluetooth 5.2
de: Konnektivität: 5G, WiFi 6, Bluetooth 5.2
fr: Connectivité: 5G, WiFi 6, Bluetooth 5.2
it: Connettività: 5G, WiFi 6, Bluetooth 5.2

source: Sistema: Android 14
de: System: Android 14
fr: Système: Android 14

source: Agregar al Carrito
de: In den Warenkorb
fr: Ajouter au Panier
it: Aggiungi al Carrello

source: Comprar Ahora
de: Jetzt kaufen
fr: Acheter Maintenant
it: Acquista Ora

source: ♡ Favoritos
de: ♡ Favoriten
fr: ♡ Favoris
it: ♡ Preferiti

source: Documentación
de: Dokumentation
fr: Documentation
it: Documentazione

source: Acerca de
de: Über uns
fr: À propos
it: Chi siamo

source: Ejemplo de Internacionalización
de: Internationalisierungsbeispiel
fr: Exemple d'Internationalisation
it: Esempio di Internazionalizzazione

source: Aprendiendo a usar i18n, traducir textos y más
de: Lernen Sie, i18n zu verwenden, Texte zu übersetzen und mehr
fr: Apprendre à utiliser i18n, traduire des textes et plus
it: Imparare a usare i18n, tradurre testi e altro
